import datetime
from collections import OrderedDict
from bidict import bidict

#十天干
十天干的名字列表 = ["甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"]
#十二地支
十二地支的名字列表 = ["子", "丑", "寅", "卯", "辰", "巳", "午", "未", "申", "酉", "戌", "亥"]


'''
《“大头秀”和“小头秀”》
'''
# 【名词解释】“大头秀”里的“大头”指 天干五行力量特别强，而地支相对虚弱或缺乏支持（表现为命局的天干透出较多同“五行”的天干，两个以上相同的天干出现，但地支中没有足够的根来支撑这些天干的力量）。
# 【名词解释】“大头秀”里的“秀”指这个五行力量由于缺乏地支的根基，显得虚浮，力大无根，难以落实为实际的富贵，容易形成表面光鲜、内在虚弱的命局特征。可能在年轻时表现得有潜力、容易受关注，但由于内在根基不足，事业或生活很容易在中年之后失去支撑。
# 【名词解释】“小头”指的是 地支中某种五行的力量特别强大，但天干上没显化或显化少。常见于地支中三合、三会局、藏干力大的地支组合，天干却未显现相应的五行。因为天干没有透出，导致地支五行无法充分发挥作用，局限在内，未能表现为实际的富贵，命主容易被埋没。
#【历史】《三命通会》、《滴天髓》、《渊海子平》论述天干透干与地支藏根的关系时，隐含了类似思想。    明清时期概括为“大头秀”、“小头秀”。
#【流派】南派命理 和 江浙一带的命理流派 爱用“大头秀”和“小头秀”概念。这些流派特别强调天干和地支之间关系、是否具备“根”。
datouxiu = ("壬子", "癸丑", "丙辰", "丁巳", "戊午", "己未", "庚申", "辛酉")

xiaotouxiu = ("壬午", "癸未", "庚子", "辛丑", "戊子", "己丑")


# 寒冷燥湿li'lun
# temps 代表的是每个天干地支的"热力值"。  正数代表阳性（热），负数代表阴性（冷）。 【用途】通过“temps”的正负数值，可以判断命局的阴阳平衡；"temps"的绝对值数值，可以评估五行的强弱；通过 temps_scores，可以计算命局的整体"温度"。
temps = {"甲":3, "乙":1, "丙":6, "丁":4, "戊":5, "己":-4, "庚":-1, "辛":-3, "壬":-5, "癸":-6,"子":-6, "丑":-4, "寅":3, "卯":1, "辰":-4, 
            "巳":5, "午":6, "未":3, "申":-2, "酉":-3,"戌":4, "亥":-5}

# 地支的十二时辰
地支_time = {"子":'23-1', "丑":'1-3', "寅":'3-5', "卯":'5-7', "辰":'7-9', 
            "巳":'9-11', "午":'11-13', "未":'13-15', "申":'15-17', "酉":'17-19',
            "戌":'19-21', "亥":'21-23'}

zhengs = "子午卯酉"     #【正四时】。四个地支对应一天中的：子时、午时、卯时、酉时。（《三命通会》《渊海子平》都认为子午卯酉四个时辰被认为是一天中最重要的时段，具有特殊能量。）



#天干地支的五行列表
wuhangs = {
    '金':"庚辛申酉",
    '木':"甲乙寅卯",    
    '水':"壬癸子亥",
    '火':"丙丁巳午",     
    '土':"戊己丑辰未戌",         
}


#天干的五行列表
天干的五行列表 = {
    '金': ["庚", "辛"],
    '木': ["甲", "乙"],    
    '水': ["壬", "癸"],
    '火': ["丙", "丁"],     
    '土': ["戊", "己"],         
}



#六十甲子
天干地支60 = bidict({
    1:"甲子", 13:"丙子", 25:"戊子", 37:"庚子", 49:"壬子", 2:"乙丑", 14:"丁丑", 26:"己丑", 38:"辛丑", 50:"癸丑", 
    3:"丙寅", 15:"戊寅", 27:"庚寅", 39:"壬寅", 51:"甲寅", 4:"丁卯", 16:"己卯", 28:"辛卯", 40:"癸卯", 52:"乙卯", 
    5:"戊辰", 17:"庚辰", 29:"壬辰", 41:"甲辰", 53:"丙辰", 6:"己巳", 18:"辛巳", 30:"癸巳", 42:"乙巳", 54:"丁巳", 
    7:"庚午", 19:"壬午", 31:"甲午", 43:"丙午", 55:"戊午", 8:"辛未", 20:"癸未", 32:"乙未", 44:"丁未", 56:"己未", 
    9:"壬申", 21:"甲申", 33:"丙申", 45:"戊申", 57:"庚申", 10:"癸酉", 22:"乙酉", 34:"丁酉", 46:"己酉", 58:"辛酉", 
    11:"甲戌", 23:"丙戌", 35:"戊戌", 47:"庚戌", 59:"壬戌", 12:"乙亥", 24:"丁亥", 36:"己亥", 48:"辛亥", 60:"癸亥"})



# 地支5 是一个《地支藏干》字典，键是地支，值是与该地支相关的[天干]及其[力量]的字典(例如，地支5["丑"] 可能是 {"己": 5, "癸": 3, "辛": 2}，表示丑土藏有己土、癸水和辛金，力量分别是5、3和2) 。 设置 地支5 的意图是为了方便获取地支中所藏天干的详细信息，包括它们的五行属性、力量和与日主的十神关系。
# 这个是带有地支藏干具体力量数值的↓
地支藏干字典 = {
    "子":OrderedDict({"癸":8}), 
    "丑":OrderedDict({"己":5, "癸":2, "辛":1,}), 
    "寅":OrderedDict({"甲":5, "丙":2, "戊":1, }),
    "卯":OrderedDict({"乙":8}),
    "辰":OrderedDict({"戊":5, "乙":2, "癸":1, }),
    "巳":OrderedDict({"丙":5, "戊":2, "庚":1,}),
    "午":OrderedDict({"丁":5, "己":3, }),
    "未":OrderedDict({"己":5, "丁":2, "乙":1,}),
    "申":OrderedDict({"庚":5, "壬":2, "戊":1, }),
    "酉":OrderedDict({"辛":8}),
    "戌":OrderedDict({"戊":5, "辛":2, "丁":1 }),
    "亥":OrderedDict({"壬":5, "甲":3, })}

# 这个是普通的地支藏干列表（无数值）↓
地支藏干字典_无值版 = {
    "子":["癸"], 
    "丑":["己", "癸", "辛"], 
    "寅":["甲", "丙", "戊"],
    "卯":["乙"],
    "辰":["戊", "乙", "癸"],
    "巳":[ "丙", "戊", "庚"],
    "午":["丁", "己"],
    "未":["己", "丁", "乙"],
    "申":["庚", "壬", "戊"],
    "酉":["辛"],
    "戌":["戊", "辛", "丁" ],
    "亥":["壬", "甲",]}


ShX = ["鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪"]
numCn = ["零", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十"]
Week = ["日", "一", "二", "三", "四", "五", "六"]
jqmc = ["冬至", "小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨", "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑","白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪"]
jis = {0:'冬', 1:'春', 2:'夏', 3:'秋', 4:'冬'}
ymc = ["十一", "十二", "正", "二", "三", "四", "五", "六", "七", "八", "九", "十" ]
rmc = ["初一", "初二", "初三", "初四", "初五", "初六", "初七", "初八", "初九", "初十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "廿一", "廿二", "廿三", "廿四", "廿五", "廿六", "廿七", "廿八", "廿九", "三十", "卅一"]


# 十神关系表  （举例：当日主为甲时，甲的比肩是甲，甲的劫是乙，食神是丙，伤官是丁……）
十神关系表 = {
    '甲':bidict({'甲':'比肩', "乙":'劫财', "丙":'食神', "丁":'伤官', "戊":'偏财',
                  "己":'正财', "庚":'七杀', "辛":'正官', "壬":'偏印(枭)', "癸":'正印', "子":'沐', 
                  "丑":'冠', "寅":'建', "卯":'帝', "辰":'衰', "巳":'病', "午":'死', 
                  "未":'墓', "申":'绝', "酉":'胎', "戌":'养', "亥":'长', '库':'未_', 
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'己','冲':'庚'}),
    '乙':bidict({'甲':'劫财', "乙":'比肩', "丙":'伤官', "丁":'食神', "戊":'正财',
                  "己":'偏财', "庚":'正官', "辛":'七杀', "壬":'正印',"癸":'偏印(枭)', "子":'病', 
                  "丑":'衰', "寅":'帝', "卯":'建', "辰":'冠', "巳":'沐', "午":'长',
                  "未":'养', "申":'胎', "酉":'绝', "戌":'墓', "亥":'死', '库':'未_',
                  '本':'木', '克':'土', '被克':'金', '生我':'水', '生':'火','合':'庚','冲':'辛'}),
    '丙':bidict({'丙':'比肩', "丁":'劫财', "戊":'食神', "己":'伤官', "庚":'偏财',
                  "辛":'正财', "壬":'七杀', "癸":'正官', "甲":'偏印(枭)', "乙":'正印',"子":'胎', 
                  "丑":'养', "寅":'长', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'绝', '库':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'辛','冲':'壬'}),
    '丁':bidict({'丙':'劫财', "丁":'比肩', "戊":'伤官', "己":'食神', "庚":'正财',
                  "辛":'偏财', "壬":'正官', "癸":'七杀', "甲":'正印',"乙":'偏印(枭)', "子":'绝', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'长', "戌":'养', "亥":'胎', '库':'戌_',
                  '本':'火', '克':'金', '被克':'水', '生我':'木', '生':'土','合':'壬','冲':'癸'}),
    '戊':bidict({'戊':'比肩', "己":'劫财', "庚":'食神', "辛":'伤官', "壬":'偏财',
                  "癸":'正财', "甲":'七杀', "乙":'正官', "丙":'偏印(枭)', "丁":'正印',"子":'胎', 
                  "丑":'养', "寅":'长', "卯":'沐', "辰":'冠', "巳":'建', "午":'帝',
                  "未":'衰', "申":'病', "酉":'死', "戌":'墓', "亥":'绝', '库':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'癸','冲':''}),
    '己':bidict({'戊':'劫财', "己":'比肩', "庚":'伤官', "辛":'食神', "壬":'正财',
                  "癸":'偏财', "甲":'正官', "乙":'七杀', "丙":'正印',"丁":'偏印(枭)',"子":'绝', 
                  "丑":'墓', "寅":'死', "卯":'病', "辰":'衰', "巳":'帝', "午":'建',
                  "未":'冠', "申":'沐', "酉":'长', "戌":'养', "亥":'胎', '库':'辰_',
                  '本':'土', '克':'水', '被克':'木', '生我':'火', '生':'金','合':'甲','冲':''}),
    '庚':bidict({'庚':'比肩', "辛":'劫财', "壬":'食神', "癸":'伤官', "甲":'偏财',
                  "乙":'正财', "丙":'七杀', "丁":'正官', "戊":'偏印(枭)', "己":'正印',"子":'死', 
                  "丑":'墓', "寅":'绝', "卯":'胎', "辰":'养', "巳":'长', "午":'沐',
                  "未":'冠', "申":'建', "酉":'帝', "戌":'衰', "亥":'病', '库':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'乙','冲':'甲'}), 
    '辛':bidict({'庚':'劫财', "辛":'比肩', "壬":'伤官', "癸":'食神', "甲":'正财',
                  "乙":'偏财', "丙":'正官', "丁":'七杀', "戊":'正印', "己":'偏印(枭)', "子":'长', 
                  "丑":'养', "寅":'胎', "卯":'绝', "辰":'墓', "巳":'死', "午":'病',
                  "未":'衰', "申":'帝', "酉":'建', "戌":'冠', "亥":'沐', '库':'丑_',
                  '本':'金', '克':'木', '被克':'火', '生我':'土', '生':'水','合':'丙','冲':'乙'}),
    '壬':bidict({'壬':'比肩', "癸":'劫财', "甲":'食神', "乙":'伤官', "丙":'偏财',
                  "丁":'正财', "戊":'七杀', "己":'正官', "庚":'偏印(枭)', "辛":'正印',"子":'帝', 
                  "丑":'衰', "寅":'病', "卯":'死', "辰":'墓', "巳":'绝', "午":'胎',
                  "未":'养', "申":'长', "酉":'沐', "戌":'冠', "亥":'建', '库':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'丁','冲':'丙'}),
    '癸':bidict({'壬':'劫财', "癸":'比肩', "甲":'伤官', "乙":'食神', "丙":'正财',
                  "丁":'偏财', "戊":'正官', "己":'七杀', "庚":'正印',"辛":'偏印(枭)', "子":'建', 
                  "丑":'冠', "寅":'沐', "卯":'长', "辰":'养', "巳":'胎', "午":'绝',
                  "未":'墓', "申":'死', "酉":'病', "戌":'衰', "亥":'帝', '库':'辰_',
                  '本':'水', '克':'火', '被克':'土', '生我':'金', '生':'木','合':'戊','冲':'丁'}), 

}


#意象池
十神意象 = {
    "正印": [
        "学历文凭", "房产（阳宅）", "童年住的老宅", "长期居住的房子", 
        "母亲（男命）", "权力", "理科成绩", "祖产/祖宅", "智慧", "庇佑", 
        "学术地位", "教育", "温和性格"
    ],
    "偏印": [
        "阴宅", "新房子", "新车子", "边缘学科（传统文化/玄学）", "虚空世界", 
        "祖坟", "社会影响力名声", "文科成绩", "医药", "心理学", "宗教", 
        "孤独", "另类学术"
    ],
    "正官": [
        "事业", "管理","产品", "男朋友（女命）", "长期事务", "[性格]严格要求自己", 
        "官司牢狱", "口舌是非", "[社会环境] 社会影响力", 
        "产品的知名度", "国家的政策法规", "[外环境]正义感", 
        "爱岗敬业", "工作能力", "管理水平", "职位", "权威", 
        "责任", "道德观"
    ],
    "七杀": [
        "公检法", "脾气","胆大", "正义", "暴力武力", "男朋友", "新鲜事务", 
        "偏门（不走寻常路，不随大流）", "灵感爆发力", "冒险", 
        "急功近利", "强权"
    ],
    "食神": [
        "才华","意念", "打坐", "女儿", "美食", "享受生活", "长寿", 
        "娱乐", "艺术创作", "教学", "子孙运", "健康", "放松", "自在心态"
    ],
    "伤官": [
        "口才","[恋爱]女命看偏官", "偏官的外环境吉，内环境不吉，恋爱多但不落实", 
        "新工作", "口头型生意", "表达能力好", "聪明", "伤官对正财没好作用", 
        "心直口快", "脾气急躁", "创造力", "反叛"
    ],
    "空亡": [
        "无疾而终", "失去", "虚无感", "不真实", "消亡", "虚无缥缈", "不完整"
    ],
    "正财": [
        "薪水等固定收入低", "父亲（男命）", 
        "稳定收入", "财富管理", "现实利益", "家庭财产"
    ],
    "偏财": [
        "创业赚钱", "女朋友（男命）", "父亲（男命）",
        "丢钱包", "外债能不能要回来",
        "[情境：偏财地支不吉但日支对其有作用]钱要出去一部分，自己也能要到一部分", 
        "投资", "流动性收入"
    ],
    "比肩": [
        "竞争", "兄弟", "朋友", "合作伙伴", "平等关系", "独立", 
        "资源分享", "支出增加", "自我主张", "奋斗精神"
    ]
}



#专题
看专题 = {
    "出生时家境贫富": ["正印：如果正印吉，环境吉（正印代表小时候出生房子），说明小时候家庭条件好;     父母的偏财：看父母偏财吉凶程度;     看出生时的大运,偏财和正印的吉凶;  "],
    "看父母对女友态度": ["正印：母亲; 偏财：女友—— 看正印对偏财是否起好作用"],
    "看某六亲对某六亲态度": ["天干和天干作用，地支和地支作用。天干代表大家看得见的，地支代表内心想法"],
    "看学习文凭": ["正印吉凶：理科成绩好坏; 偏印吉凶：文科成绩好坏。"],
    "考学方向": ["正官的社会环境：上学是工作，选择会促使正官的社会环境吉的那个方向。   正官吉:管理;   食神:艺术类"],
    "是否合适当兵（当兵后是否有好出路）": ["七杀:是否吉 + 七杀外环境吉;  伤官:是否吉; "],
    "工作变化": ["正官的社会环境:如果大运流年作用正官让它产生变化，代表工作会变化;    正官和正官社会环境都吉:升迁;   "],
    "看新工作/兼职的前途": ["偏官和偏官的社会环境:代表新工作/兼职的前途"],
    "出国上学/打工/涉外婚姻": ["正官的社会环境吉凶"],
    "恋爱": ["女命看偏官，男名看偏财。  偏财的外环境吉、内环境不吉:经常换女友，没有稳定下来的。  偏财的外环境吉、内环境吉:谈恋爱次数少，两人在一起时间长。   日柱对偏官/偏财起好作用:能吸引对方，反之亦然。    偏官/偏财外环境吉：对象外表有魅力。   大运对偏官/偏财吉:对象岁数年轻。  流年对偏官/偏财吉:对象容貌好看。"],
    "婚姻": ["女命看正官，男名看正财。  多婚之象:除了正财/正官 外，女命有其他的正官/偏官, 男命有其他的正财/偏财。   正官吉+正官环境吉：女命婚姻稳定。   正财吉+正财环境吉+日干对正财起好作用：男命婚姻稳定。    正财吉+偏财吉: 家里有正宫，外面有情人。婚外情持续时间看地支是否吉。 如果此时 正财凶+正财社会环境凶：离婚。  偏财吉+偏财社会环境吉：会再婚，如果都凶就不会再婚。   正财凶：第一次婚姻不顺利"],
    "权力": ["正官的内环境吉凶。  正印：代表政府机关的权力。 "],
    "实体生意": ["正官吉+正官社会环境吉：实体生意好。   正官+正官社会环境 使 偏财吉:实体生意可以盈利。"],
    "赚钱": ["正财:上班拿死工资。  偏财:奖金提成等不固定收入。 创业赚钱。  偏财外环境：行业利润。  偏财内环境：钱财落实。   偏财社会环境：发财空间/方向/平台。   正官:代表实体生意（如:加工产品）。   正官的社会环境对偏财起好作用：实体产品利于发财。"],
    "富裕贫穷": ["偏财外环境吉+内环境吉:富裕之命。 "],
    "投资": ["日干支对偏财起不起好作用:看投资结果（如果同时偏财凶，代表投资失败）。   偏财外环境吉+内环境吉：投资赚钱，别人不会欠你钱。     偏财外环境吉+内环境吉+日干支对偏财起坏作用:和别人合作发偏财，但钱要分出去一部分。     日干支对偏财起好作用:和别人合作发偏财。     日干支对偏财起好作用+偏财外环境凶+内环境凶:别人主动找你来合作，但赚的钱钱要分出去一部分。      偏财吉+外环境内环境都吉+日干支也起好作用:独美发财"],  
    "玄学": ["偏印:传统文化。  七杀:快/猛/爆发力。   食神：打坐/冥想/思维。    天生特异功能大师:偏印、七杀、食神 三者都吉。    出家人:偏财严重不吉，在贫困中看破红尘。"],  
    "看购房面积(新房?市中心?)": ["偏印外环境吉:楼龄新。 偏印内环境吉:楼房质量好/装修好。  偏印内环境凶:面积大，不利于打扫。 偏印社会环境吉/凶:市中心/郊区 "], 
    "祖坟好不好": ["偏印:看六亲起的作用。"],
    "怀孕": ["母亲日支:如果吉，代表健康怀孕，不会流产。  时支或月支对日支不起好作用:先兆流产。  时支和月支和对日支不起好作用:必定流产。  "],
    "手术择期": ["日支:大运流年对日支最吉的时候进行手术，日支代表命主本人健康情况。"],
    "生男生女": ["看父亲那方的年支(10%权重)、月支(20%权重)、日支(50%权重):超过50分才能生男孩。 如果父亲日支为忌神，日支扣50分，月支制日支，月支得20分的力量。所以生不了男孩。 "],
    "丢失财务/别人欠款": ["偏财内环境凶:容易丢钱。 日支对内环境起好作用:可以要回来。   偏财社会环境的内环境对偏财起好作用:欠你钱的人其实有钱。"],
    "赌博": ["偏财外环境吉:先赢。  偏财内环境吉:一直赢。  日支对偏财内环境起好作用:赢的钱多一点。"],
    "车祸": ["七杀:保护命主的高灵，印能护体，偏印专制七杀。  七杀:飞来横祸。  七杀凶+偏印吉:逢凶化吉。    七杀凶+日干支对七杀起坏作用:双方都有责任。   日干支使七杀凶:别人全责。   七杀外环境凶+内环境吉:伤害不大。    七杀外环境凶+内环境凶+日干支对七杀起坏作用:伤害严重。"],
    "官灾/口舌是非": ["正官凶:违法乱纪。 伤官: 。     官灾的严重程度:结合先天风水、大运流年。  正官为忌神+又旺+有根：牢狱之灾。    正官社会环境大凶或小凶:别人告你 或 小人打小报告。   正官社会环境吉:官司是非中有别人帮助你。"],
    "谋杀还是自杀": ["七杀内环境凶+日支凶+日支使七杀内环境凶:自杀。   七杀凶+日干支对七杀起坏作用:谋杀。"],
    "生病": ["日支受时支和月支的制:实病。    食神凶+偏印凶:精神虚病。  "],
    "死亡": ["命局平衡被严重打破。 "],
    "催桃花": ["在男命偏财 女命偏官的方向:开窗/放水/放桃花。"],
    "催官/催财": ["代表官/财的十神的天干的方位(用神):开窗、不要有遮挡。   代表官/财的十神的天干的方位(忌神):遮挡住。  地支为用神:代表地支的那个方位要低。   地支为忌神:代表地支的那个方位要高。"],
    "择日": ["偏印:选偏印大吉的日子。"],
    "学习成绩": ["食神吉+伤官吉:聪明。  正官吉:自律能力好，代表学校里成绩好。"],
}





十天干意象 = {
    "甲": [
        "头发", "第一", "东方", "神经脑力", "盔甲", "文化类事业", "树木", "高大", 
        "坚韧", "外向", "领导才能", "突破", "阳刚", "生机勃勃", "冒险精神",
        "甲木代表阳木", "高大的树木", "正绿色", "春天的生长力", "挺拔", 
        "象征正直与力量", "阳光下的绿叶"
    ],
    "乙": [
        "神经", "脑力", "东方","大脑", "眼睛", "眼眉", "柔和", "细腻", "内向", 
        "植物的藤蔓", "策划", "沟通协调", "艺术", "美容", "智慧",
        "乙木代表阴木", "细柔的藤蔓", "墨绿色", "春天的细致生长", "灵活", 
        "象征温和与适应力", "阴影下的绿叶"
    ],
    "丙": [
        "眼睛", "热情", "南方", "心脏", "太阳", "光明", "生命力", "行动力", "开朗", 
        "强烈的表达欲望", "乐观", "积极向上", "外放的情绪", "自信", "活力",
        "丙火代表阳火", "明亮的太阳", "正红色", "夏天的炽热", "炽热与激情", 
        "象征活力与热情", "阳光下的火焰"
    ],
    "丁": [
        "心包", "小肠", "南方", "火", "灯光", "内心的热情", "温暖", "感性", "细腻的情感", 
        "照顾他人", "精致", "柔和的光辉", "家庭责任感", "内心的温暖", 
        "情感上的关怀", "聪慧",
        "丁火代表阴火", "微小的烛火", "暗红色", "夏天的余温", "温和与细腻", 
        "象征温暖与情感", "烛光下的火焰"
    ],
    "戊": [
        "胃", "脸", "中央", "大地", "厚重", "稳重", "诚实", "可靠", "保护", 
        "建设", "组织管理", "中正", "稳定", "固执", "防守", "承载万物",
        "戊土代表阳土", "坚实的大地", "黄色", "长夏的稳定", "厚重与稳固", 
        "象征坚实与责任", "阳光下的土地"
    ],
    "己": [
        "脾", "柔土", "中央", "田地", "农田", "细致", "有序", "细心", "保护", 
        "家庭", "内向", "耐心", "土地的滋养", "耕种", "环境", "温和",
        "己土代表阴土", "柔软的土地", "土黄色", "长夏的湿润", "细腻与包容", 
        "象征温和与滋养", "阴影下的土地"
    ],
    "庚": [
        "肺", "高冷", "西方", "严肃", "金属", "刀剑", "强硬", "刚毅", "正义感", 
        "果断", "执行力", "权威", "严厉", "力量", "秩序", "纪律",
        "庚金代表阳金", "坚硬的金属", "白色或银色", "秋天的收获", "锐利与坚毅", 
        "象征力量与决断", "阳光下的金属光泽"
    ],
    "辛": [
        "大肠", "金", "西方", "珠宝", "优雅", "美丽", "细致", "奢华", "权谋", 
        "高贵", "内敛", "冷静", "策略", "精致", "精准", "秘密", "神秘",
        "辛金代表阴金", "精致的金属", "金黄色或淡金色", "秋天的柔和", 
        "精细与优雅", "象征高贵与智慧", "月光下的金属光泽"
    ],
    "壬": [
        "肾", "语言",  "北方", "黑色", "龙", "江河", "大海", "包容性", "广阔", 
        "思维活跃", "变化多端", "适应力强", "神秘", "智慧", "感性", "包容",
        "壬水代表阳水", "奔流的江河", "深蓝色", "冬天的初雪融化", 
        "广阔与流动", "象征包容与智慧", "阳光下的水面波光粼粼"
    ],
    "癸": [
        "膀胱", "水", "北方", "雨露", "滋润", "细腻", "潜伏", "沉默", "智慧", 
        "冷静", "温和", "细致入微", "内敛", "潜力", "资源", "孕育", "隐忍",
        "癸水代表阴水", "静谧的水源", "浅蓝色", "冬天的深水", "静谧与内敛", 
        "象征智慧与潜力", "月夜下的水面"
    ]
}

先天风水旺弱意象体现 = {
    "面部": ["按十二地支的方位对应到脸上，如果脸上哪个地方有痘坑或疤痕的问题，说明该地支力量弱。如果某部位特别好看，说明该地支力量强——如果该地支为用神就旺，为忌神就弱。如果眼睛特别好看，说明'丙'最旺，'丙'克的是金，所以'庚'是最弱的。"],
    "身高": ["身高很高，代表日支有力。如果日支为用神,身高越高,日支力量越旺。如果日支为忌神,身高越高,日支力量越弱。"],
}


八字位置意象 = {
    "年柱": ["身体上部"],
    "月柱": ["身体左侧", "身体前面"],
    "时柱": ["身体右侧", "身体后面", "身体下部"],
    "日柱": ["身体中间"],
}

取意象须知 = {
    "双重应征的例子": ["因为心脏在左边，如果是在时柱上巳或午为忌神，比在月柱上巳或午为忌神，心脏病的严重程度要弱很多。因为时柱代表身体右侧，因为月柱代表身体左侧。"],
}


十二地支意象 = {
    "子": [
        "五行：水",
        "颜色：黑色",
        "方位：正北方",
        "动物：鼠",
        "对应人体部位：肾",
        "时间：23:00-01:00（子时）",
        "季节：冬季",
        "自然现象：冬季的寒冷与宁静",
        "植物：柳树",
        "象征意象：包容、智慧、灵活、流动、潜力",
        "方位意象：北方的寒冷与深邃，象征着隐藏的力量与潜在的发展"
    ],
    "丑": [
        "五行：湿土",
        "颜色：褐色",
        "方位：东北方",
        "动物：牛",
        "对应人体部位：脾、消化能力、会阴皮肤",
        "时间：01:00-03:00（丑时）",
        "季节：冬末春初",
        "自然现象：春回大地，万物复苏",
        "植物：松树",
        "象征意象：稳重、耐劳、积累、滋养、坚韧",
        "方位意象：东北方的寒冷逐渐消退，象征着积累与准备"
    ],
    "寅": [
        "五行：木",
        "颜色：青色",
        "方位：东南方",
        "动物：虎",
        "对应人体部位：肝、腿、腿关节",
        "时间：03:00-05:00（寅时）",
        "季节：春季",
        "自然现象：春天的生长与活力",
        "植物：桃花",
        "象征意象：生长、活力、勇敢、开拓、创新",
        "方位意象：东南方的生机与活力，象征着新的开始与发展"
    ],
    "卯": [
        "五行：木",
        "颜色：绿色",
        "方位：东方",
        "动物：兔",
        "对应人体部位：胆",
        "时间：05:00-07:00（卯时）",
        "季节：春季",
        "自然现象：花开繁盛，万物生长",
        "植物：樱花",
        "象征意象：柔和、敏捷、灵活、协调、和平",
        "方位意象：东方的和煦与生机，象征着和平与协调"
    ],
    "辰": [
        "五行：土",
        "颜色：黄色",
        "方位：东南方",
        "动物：龙",
        "对应人体部位：脾胃",
        "时间：07:00-09:00（辰时）",
        "季节：春末夏初",
        "自然现象：春夏交替，气候温暖",
        "植物：竹子",
        "象征意象：包容、力量、变革、进取、灵动",
        "方位意象：东南方的活力与变化，象征着进取与包容"
    ],
    "巳": [
        "五行：火",
        "颜色：红色",
        "方位：南方",
        "动物：蛇",
        "对应人体部位：心",
        "时间：09:00-11:00（巳时）",
        "季节：夏季",
        "自然现象：夏日的炎热与繁荣",
        "植物：荷花",
        "象征意象：热情、智慧、灵活、敏锐、活力",
        "方位意象：南方的热情与活力，象征着智慧与灵动"
    ],
    "午": [
        "五行：火",
        "颜色：红色",
        "方位：正南方",
        "动物：马",
        "对应人体部位：心包、小肠",
        "时间：11:00-13:00（午时）",
        "季节：夏季",
        "自然现象：正午的阳光，盛夏的繁荣",
        "植物：向日葵",
        "象征意象：光明、力量、激情、行动、领导",
        "方位意象：正南方的光明与热情，象征着力量与领导力"
    ],
    "未": [
        "五行：土",
        "颜色：土黄色",
        "方位：西南方",
        "动物：羊",
        "对应人体部位：脾",
        "时间：13:00-15:00（未时）",
        "季节：夏末秋初",
        "自然现象：秋季的丰收与宁静",
        "植物：菊花",
        "象征意象：温和、稳定、滋养、包容、和谐",
        "方位意象：西南方的宁静与丰收，象征着和谐与稳定"
    ],
    "申": [
        "五行：金",
        "颜色：白色",
        "方位：西方",
        "动物：猴",
        "对应人体部位：肺",
        "时间：15:00-17:00（申时）",
        "季节：秋季",
        "自然现象：秋高气爽，万物收敛",
        "植物：桂花",
        "象征意象：机智、灵活、创造、变革、适应",
        "方位意象：西方的凉爽与收敛，象征着智慧与适应力"
    ],
    "酉": [
        "五行：金",
        "颜色：金色",
        "方位：西方",
        "动物：鸡",
        "对应人体部位：大肠",
        "时间：17:00-19:00（酉时）",
        "季节：秋季",
        "自然现象：日落西山，秋风萧瑟",
        "植物：银杏",
        "象征意象：精准、冷静、果断、效率、秩序",
        "方位意象：西方的冷静与秩序，象征着精准与效率"
    ],
    "戌": [
        "五行：土",
        "颜色：黄色",
        "方位：西北方",
        "动物：狗",
        "对应人体部位：脾胃",
        "时间：19:00-21:00（戌时）",
        "季节：秋末冬初",
        "自然现象：寒冷渐至，万物收藏",
        "植物：松树",
        "象征意象：忠诚、守护、稳定、可靠、责任",
        "方位意象：西北方的寒冷与坚固，象征着忠诚与守护"
    ],
    "亥": [
        "五行：水",
        "颜色：蓝色",
        "方位：正北方",
        "动物：猪",
        "对应人体部位：肾",
        "时间：21:00-23:00（亥时）",
        "季节：冬季",
        "自然现象：冬季的寒冷与深沉",
        "植物：冬青",
        "象征意象：包容、智慧、潜力、灵动、柔和",
        "方位意象：正北方的深沉与包容，象征着智慧与潜力"
    ]
}





ju = {
    '本':'刃', '被克':'七杀',  '克':'偏财', '生':'伤官', '生我':'偏印(枭)',
}

shengxiaos = bidict({
    "子":"鼠", "丑":"牛", "寅":"虎", "卯":"兔", "辰":"龙", "巳":"蛇", 
    "午":"马", "未":"羊", "申":"猴", "酉":"鸡", "戌":"狗", "亥":"猪"})


地支合会破刑害字典 = {
    "子":{"冲":"午", "刑":"卯", "被刑":"卯", "合":("申","辰"), "会":("亥","丑"), '害':'未', '破':'酉', "六":"丑","暗":"",},
    "丑":{"冲":"未", "刑":"戌", "被刑":"未", "合":("巳","酉"), "会":("子","亥"), '害':'午', '破':'辰', "六":"子","暗":"寅",},
    "寅":{"冲":"申", "刑":"巳", "被刑":"申", "合":("午","戌"), "会":("卯","辰"), '害':'巳', '破':'亥', "六":"亥","暗":"丑",},
    "卯":{"冲":"酉", "刑":"子", "被刑":"子", "合":("未","亥"), "会":("寅","辰"), '害':'辰', '破':'午', "六":"戌","暗":"申",},
    "辰":{"冲":"戌", "刑":"辰", "被刑":"辰", "合":("子","申"), "会":("寅","卯"), '害':'卯', '破':'丑', "六":"酉","暗":"",},
    "巳":{"冲":"亥", "刑":"申", "被刑":"寅", "合":("酉","丑"), "会":("午","未"), '害':'寅', '破':'申', "六":"申","暗":"",},
    "午":{"冲":"子", "刑":"午", "被刑":"午", "合":("寅","戌"), "会":("巳","未"), '害':'丑', '破':'卯', "六":"未","暗":"亥",},
    "未":{"冲":"丑", "刑":"丑", "被刑":"戌", "合":("卯","亥"), "会":("巳","午"), '害':'子', '破':'戌', "六":"午","暗":"",},
    "申":{"冲":"寅", "刑":"寅", "被刑":"巳", "合":("子","辰"), "会":("酉","戌"), '害':'亥', '破':'巳', "六":"巳","暗":"卯",},
    "酉":{"冲":"卯", "刑":"酉", "被刑":"酉", "合":("巳","丑"), "会":("申","戌"), '害':'戌', '破':'子', "六":"辰","暗":"",},
    "戌":{"冲":"辰", "刑":"未", "被刑":"丑", "合":("午","寅"), "会":("申","酉"), '害':'酉', '破':'未', "六":"卯","暗":"",},
    "亥":{"冲":"巳", "刑":"亥", "被刑":"亥", "合":("卯","未"), "会":("子","丑"), '害':'申', '破':'寅', "六":"寅","暗":"午",},
}




# 库藏 （科普：五行的仓库，某种五行在运行到其库藏地支时，会进入休息的状态，被视为力量收敛和封藏。）
# 【历史】《渊海子平》《三命通会》明确提到了“四库”的概念。  【流派】南派和盲派很重视“库藏”的影响。
kus = {'丑':"水土", '辰':"水土", '戌':'火土', '未':'火土',}



# 干合
天干_hes = {
    ("甲", "己"): "中正之合 化土 尊崇重大,宽厚平直。如带煞而五行无气则多嗔好怒,性梗不可屈",
    ("乙", "庚"): '''仁义之合　化金 果敢有守, 不惑柔佞,周旋唯仁,进退唯义。''',
    ("丙", "辛"): '''威制之合　化水 ''',
    ("丁", "壬"): '''淫慝之合　化木 ''',    
    ("戊", "癸"): '''无情之合　化火''',    
}

# 干冲
天干_chongs = {("甲", "庚"): "相冲",   ("乙", "辛"): "相冲",
              ("丙", "壬"): "相冲", ("丁", "癸"): "相冲",}    

# 地支对地支的“支冲”（六冲作用）
chongs = { 
    "甲":"庚", "庚":"甲","乙":"辛", "辛":"乙","丙":"壬", "壬":"丙", "丁":"癸",
    "癸":"丁", "子":"午", "午":"子", "丑":"未", "未":"丑", "寅":"申",  "申":"寅", 
    "卯":"酉",  "酉":"卯", "辰":"戌", "戌":"辰", "巳":"亥", "亥":"巳"
}

# 地支六合   （六合：子丑合土，寅亥合木，卯戌合火，酉辰合金，申巳合水，午未合土）
# 【历史】《渊海子平》和《三命通会》都提到了“六合”的概念。   【流派】南派和盲派很重视“六合”的影响。
地支_6hes = {
    "子丑": "土",
    "寅亥": "木",
    "卯戌": "火",
    "酉辰": "金",    
    "申巳": "水",    
    "未午": "土",        
}

# 地支三合
# 【历史】《渊海子平》和《三命通会》都提到了“三合”的概念。   【流派】南派和盲派很重视“三合”的影响。
地支_3hes = {"申子辰": "水 寅","巳酉丑": "金 亥",  "寅午戌": "火 申", "亥卯未": "木 巳"}
# 拱和  (某些地支之间虽然没有直接相合，但由于中间隔着某个地支，形成一种间接的五行合化关系)
# 【历史】《三命通会》提到了“拱和”的概念。   【流派】南派重视“拱和”。
gong_he = {"申辰": '子', "巳丑": '酉', "寅戌": '午', "亥未": '卯',
           "辰申": '子', "丑巳": '酉', "戌寅": '午', "未亥": '卯',}

# 地支半合
地支_half_3hes = {
    ("申", "子"): "化水  马在寅",
    ("子", "辰"): "化水  马在寅",
    ("申", "辰"): "化水  马在寅",    
    ("巳", "酉"): "化金 马在亥",  
    ("酉", "丑"): "化金 马在亥",  
    ("巳", "丑"): "化金 马在亥",      
    ("寅", "午"): "化火 马在申",    
    ("午", "戌"): "化火 马在申",   
    ("寅", "戌"): "化火 马在申",   
    ("亥", "卯"): "化木 马在巳",
    ("亥","未"): "化木 马在巳",
    ( "卯", "未"): "化木 马在巳",
}

# 地支合化
地支_hes = {
    "申子辰": "水",
    "巳酉丑": "金",  
    "寅午戌": "火", 
    "亥卯未": "木"
}

# 地支会局
地支_huis = {
    "亥子丑": "水",
    "寅卯辰": "木",  
    "巳午未": "火",       
    "申酉戌": "金",
}

# 拱会
gong_hui = {"亥丑": '子', "寅辰": '卯', "巳未": '午', "申戌": '酉',
           "丑亥": '子', "辰寅": '卯', "未巳": '午', "戌申": '酉',}

# 地支相冲
地支_chongs = {
    ("子", "午"): "相冲",
    ("丑", "未"): "相冲",
    ("寅", "申"): "相冲",
    ("卯", "酉"): "相冲",
    ("辰", "戌"): "相冲",   
    ("巳", "亥"): "相冲",       
}

# 地支相破
地支_poes = {
    ("子", "酉"): "相破",
    ("午", "卯"): "相破",
    #("巳", "申"): "相破", 
    #("寅", "亥"): "相破",
    ("辰", "丑"): "相破",   
    ("戌", "未"): "相破",       
}

# 地支相害
地支_haies = {
    ("子", "未"): '''
    未害子 谓未旺土，亥子旺水，名势家相害。故子见未则为害。
    不利六亲骨肉。入贵格多妻妾之累,入贱格孤独无倚。''',
    ("丑", "午"): '''
    午害丑 谓午以旺火凌丑死金，名正官鬼相害。故丑见午，而午更带丑干之真鬼则为害尤甚。 
    生旺,主好胜多怒,严毅不忍;死绝主毒害、伤官惨、倾覆之事。入贵格 则主大权,司刑典狱;
    入贱格则谋生于不义之地。''',
    ("寅", "巳"): '''
    互相相害 生旺则主神洁貌俊,好争夺,喜激作;值死绝则多谋少成,强学人做事,兀兀趋进不厌。
    入贵格则有操守, 善机权;入贱格则多诈、爱贫、鄙吝。''',
    ("卯", "辰"): '''
    卯害辰 谓卯以旺木凌辰死土，此以少凌长相害。故辰见卯，而卯更带辰干真鬼则其害尤甚。 
    生旺,主好胜多怒,严毅不忍;死绝主毒害、伤官惨、倾覆之事。入贵格 则主大权,司刑典狱;
    入贱格则谋生于不义之地。''',
    ("申", "亥"): '''
    互相相害 谓名恃临正官，竞嫉，争进相害。故申见亥，亥见申均为害，更纳音相克者重。 
    生旺则主神洁貌俊,好争夺,喜激作;值死绝则多谋少成,强学人做事,兀兀趋进不厌。
    入贵格则有操守, 善机权;入贱格则多诈、爱贫、鄙吝。''',   
    ("酉", "戌"): '''
    戌害酉 戌以死火害酉旺金，此嫉妒相害，故酉人见戌则凶，戌人见酉无灾；
    若乙酉人得戊戌，乙为真金，戊为真火，为害尤甚。 生旺,不容物,多刚戾;死绝酷狠,憎善妒能。
    入贵格 罗怯无辜,结构入讼,颇多奸佞,入贱格残害、阴狡、性佞、 不良。''',       
}

# 地支相刑
地支_xings = {
    ("寅", "巳"): "寅刑巳 无恩之刑 ",
    ("巳", "申"): "巳刑申 无恩之刑",
    ("申", "寅"): "申刑寅 无恩之刑",
    ("未", "丑"): "未刑丑 持势之刑",
    ("丑", "戌"): "丑刑戌 持势之刑",   
    ("戌", "未"): "戌刑未 持势之刑",  
    ("子", "卯"): "子刑卯　卯刑子 无礼之刑 女命见之，尤为不良 生旺主人威肃，面无和气，气强性暴，太察不容；死绝则侮慢忽略，狭劣刻剥，少孝悌，害妻子，吴越六亲。入贵格则多掌兵权，不利近侍；位居不久；入贱格则悖凶暴，多招刑祸。",       
}

# 地支自刑
xings = {"巳":"寅", "申":"巳",  "寅":"申", "丑":"未", "戌":"丑", "未":"戌",
         "子":"卯", "卯":"子", '辰':'辰', '午':'午','酉':'酉', '亥':'亥'}

# 地支自刑
地支_zixings = ['辰', '午', '酉', '亥']


#十天干五行对照表
十天干五行对照表 = {"甲":"木", "乙":"木", "丙":"火", "丁":"火", "戊":"土", "己":"土", "庚":"金", "辛":"金", "壬":"水", "癸":"水"}

# 十二地支五行对照表
十二地支五行对照表 = {"子":"水", "丑":"土", "寅":"木", "卯":"木", "辰":"土", "巳":"火", 
        "午":"火", "未":"土", "申":"金", "酉":"金", "戌":"土", "亥":"水"}


# “新派_王易成”算法的特殊关系处理📚
晦脆冲特殊关系字典 = {    
    ("丑", "丙"): "晦", ("丑", "丁"): "晦", ("丑", "戊"): "零", ("丑", "己"): "零", ("丑", "壬"): "弱", ("丑", "癸"): "旺", ("丑", "庚"): "零", ("丑", "辛"): "旺",
    ("辰", "丙"): "晦", ("辰", "丁"): "晦", ("辰", "戊"): "零", ("辰", "己"): "零", ("辰", "壬"): "零", ("辰", "癸"): "弱",
    ("戌", "丙"): "零", ("戌", "丁"): "弱", ("戌", "庚"): "脆", ("戌", "辛"): "脆",
    ("未", "丙"): "弱", ("未", "丁"): "旺", ("未", "庚"): "脆", ("未", "辛"): "脆",
    ("甲", "庚"): '冲', ("庚", "甲"): '冲',
    ("乙", "辛"): '冲', ("辛", "乙"): '冲',
    ("丙", "壬"): '冲', ("壬", "丙"): '冲',
    ("丁", "癸"): '冲', ("癸", "丁"): '冲',
    ("子", "午"): '冲', ("午", "子"): '冲',
    ("丑", "未"): '冲', ("未", "丑"): '冲',
    ("寅", "申"): '冲', ("申", "寅"): '冲',
    ("卯", "酉"): '冲', ("酉", "卯"): '冲',
    ("辰", "戌"): '冲', ("戌", "辰"): '冲',
    ("巳", "亥"): '冲', ("亥", "巳"): '冲',
    ("丑", "戌"): '刑', ("戌", "丑"): '刑',
}


# 五行作用关系字典
五行作用关系字典 = {
    ("金", "金"): '同', ("金", "木"): '克', ("金", "水"): '生', ("金", "火"): '耗', ("金", "土"): '泄',
    ("木", "木"): '同', ("木", "土"): '克', ("木", "火"): '生', ("木", "金"): '耗', ("木", "水"): '泄',
    ("水", "水"): '同', ("水", "火"): '克', ("水", "木"): '生', ("水", "土"): '耗', ("水", "金"): '泄',    
    ("火", "火"): '同', ("火", "金"): '克', ("火", "土"): '生', ("火", "水"): '耗', ("火", "木"): '泄',
    ("土", "土"): '同', ("土", "水"): '克', ("土", "金"): '生', ("土", "木"): '耗', ("土", "火"): '泄',
}


# “新派_王易成”的“有根关系”📚
有根字典 = {
    ("子", "甲"): "有根", ("子", "壬"): "有根",
    ("丑", "己"): "有根", ("丑", "辛"): "有根", ("丑", "癸"): "有根",
    ("寅", "甲"): "有根", ("寅", "丙"): "有根",
    ("卯", "乙"): "有根", ("卯", "丁"): "有根",
    ("辰", "戊"): "有根", ("辰", "庚"): "有根", ("辰", "壬"): "有根",
    ("巳", "丁"): "有根", ("巳", "己"): "有根",
    ("午", "丙"): "有根", ("午", "戊"): "有根",
    ("未", "丁"): "有根", ("未", "己"): "有根",
    ("申", "庚"): "有根", ("申", "壬"): "有根",
    ("酉", "辛"): "有根", ("酉", "癸"): "有根",
    ("戌", "丙"): "有根", ("戌", "戊"): "有根",
    ("亥", "乙"): "有根", ("亥", "癸"): "有根"
}





# 天干通根（天干在这几个地支上的时候是有“根”的）
guans = {
    "甲":('辛',"酉","戌","丑"), "乙":('庚',"申",'巳'), "丙":("癸",'丑','辰'), 
    "丁":('壬',"亥", '申'),"戊":('乙',"卯","戌","未"), "己":('甲',"寅", "亥"), 
    "庚":('丁',"午", "戌","未"), "辛":('丙',"寅",'巳'),
    "壬":('己',"午",'未','丑'), "癸":('戊',"寅","辰",'巳','申','戌'),}


天干_desc = {
    "甲":'''雷龙 梁栋 禄寅;斧斤斫削成其器。木不南奔;喜春运不喜西方,春生,处世安然,必寿。''', 
    "乙":'''风 树 禄卯 水泛木浮  秋令大吉''', 
    "丙":"电 冶 禄巳 火无西向", 
    "丁":"星 灯 禄午 火明则灭 喜遇秋. 丁巳日,多克父兄妻子,正财忌比肩劫财,兄屈弟下,巳有戊土,伤官",
    "戊":"雾霞 山 禄巳 土虚则崩 四柱带水则为上格,霞水相辉而成文彩也;年月干见癸雨后霞现", 
    "己":"元气云 真土 禄午 火燥土裂  天降时雨,山川出云 贵坐酉,贵春生,贵见正印,坐亥者不可见乙木,云升天,遇风则狼籍", 
    "庚":"月 铁 禄申 畏癸水 巳成钟鼎 水土沉埋则无声 金实无声 金沉水底 四柱有乙巳,月白风清, 秋上,冬次,春夏无取。",
    "辛":"霜 金 禄酉 土重金埋 辛人坐卯,未透乙, 大富,坐亥透丙则贵。爱冬生。", 
    "壬":"秋露云 泽 禄亥 死水横流", 
    "癸":"雨 泉脉 春霖 禄子 水不西流 癸卯日透己, 有云行雨有经济也。春夏吉,秋冬不吉"}


地支_desc = {
    "子":"墨池 正北 时喜见癸亥，谓之水归大海，又谓之双鱼游墨，必为文章士矣。",
    "丑":"柳岸 丑人时见己未，乃月照柳梢，极为上格",
    "寅":"广谷 寅生人而时戊辰者，谓之虎啸而谷风生 威震万里",
    "卯":"琼林 乙木 正东 仲春 卯年遇巳未时者，是为兔入月宫之象，主大贵。",
    "辰":"草泽 东方之次 辰逢壬戍、癸亥即龙归大海格",
    "巳":"大驿 巳生喜得辰时，蛇化轻龙，于格为千里龙驹",
    "午": "烽堠 南 属火、土，其色赤黄 时利见辰，真龙出则凡马空矣，谓之马化龙驹。",
    "未": "花园 卯乃木旺,自 成林麓;未乃木库,如人筑墙垣以护百花也,以百花言未中有 杂气耳;未年人双飞格,最妙,如辛未见戊戍,两干不杂是也。 ",
    "申":"名都 帝王所居；申宫壬水生 亥时，乃地天交泰",
    "酉":"寺钟 正西 见寅吉，谓之钟鸣谷应。",
    "戌": "烧原 戌与辰地皆贵人所不临也 戌生逢卯 春入烧痕",
    "亥":"悬河 即天门 日时见寅、辰二字，是乃水拱雷门",    
}

#通过天干看 性格、健康、家庭关系（出自《三命通会》《渊海子平》）
天干3 = {
    "甲":'天上贵，孤独守空房', 
    "乙":'多阴私，又要败祖业', 
    "丙":'人孤老，产中亡', 
    "丁":"多恶疾，手足也自伤官",
    "戊":"子随出，离祖别家乡", 
    "己":"别父母，兄弟各一方", 
    "庚":"正财郎，万里置田庄",
    "辛":"寿数长，正财滞多灾郎", 
    "壬":"家业盛，有富不久长", 
    "癸":"一亥全，烈火烧屋房"}

#通过天干看 性格、健康、家庭关系（出自《三命通会》《渊海子平》）
天干4 = {
    "甲":'少夫妻', 
    "乙":'命早亡', 
    "丙":'子息空', 
    "丁":"寿不长",
    "戊":"人孤刑", 
    "己":"人忠良", 
    "庚":"他乡走",
    "辛":"寿限长", 
    "壬":"定富足", 
    "癸":"人夭亡"}

#通过地支断 婚姻、家庭 （出自《三命通会》《渊海子平》）
地支3 = {
    "子":"婚事重",
    "丑":"四夫妻",
    "寅":"守孤寡",
    "卯":"凶恶多",
    "辰":"好斗伤官",
    "巳":"遭刑害",
    "午": "克夫妻",
    "未": "守空房 ",
    "申":"人不足",
    "酉":"独居房",
    "戌": "讼事多",
    "亥":"孤苦怜", }

#将天干地支字符串转换为 sxtwl 库中的 GZ 对象，以便进行进一步的八字推算。
def getGZ(gzStr):
    import sxtwl
    tg = -1
    dz = -1
    for i, v in enumerate(十天干的名字列表):
        if gzStr[0]  == v:
            tg = i
            break

    for i, v in enumerate(十二地支的名字列表):
        if  gzStr[1] == v:
            dz = i
            break   
    return sxtwl.GZ(tg, dz)

#根据输入的天干和地支，计算出六个相关的干支组合及其对应的年份，用于八字推算中的大运或流年分析
def get_ji柱(天干, 地支):
    
    天干_index = 十天干的名字列表.index(天干)
    地支_index = 十二地支的名字列表.index(地支) 
    result = {}
    alls = []
    for i in range(6):
        天干地支 = "{}{}".format(十天干的名字列表[(天干_index-6-i*9 )%10], 十二地支的名字列表[(地支_index-6-i*9)%12])
        result[天干地支] = get_year_of_天干地支(天干地支)
        alls += result[天干地支]
    alls.sort()
    result['all'] = alls
    return result

#根据干支组合计算对应的年份。用于推算中的流年分析。
def get_year_of_天干地支(天干地支):
    
    seq = 天干地支60.inverse[天干地支]
    year = 1983 + seq
    current_year = get_current_year()
    result = [year - 60]
    if year <=  current_year:
        result.append(year)
    return result  

#获取当前年份
def get_current_year():
    
    current_date = datetime.date.today()
    return current_date.year

#五行意象池（健康相关）
天干_health = {
    "金":'''
    秋天较走运
    申月、酉月、猴年和鸡年运气较好
    下午三点至下午七点是吉时
    
    西方是吉方
    住朝西的房子较吉利
    睡房在房子的西方较好
    睡房的西方有窗字较顺利
    金属床有利健康
    办公桌朝西有助工作效率
    吉祥颜色是白色
    室内装璜用白色系统
    穿衣用白色系列
    开白色车子较平安易发正财
    勿伤心，注意呼吸系统、肺、肠, 筋
    武术、击搏、兵器运动、健身房运动也很好
    和金有关的工作较容易''',
                                     
    "木":'''
    春天或清风徐来的天气较走运
    卯月、寅月、兔年和虎年运气较好
    上午三点至上午七点是吉时
    东方是吉方
    住朝东的房子较吉利
    睡房在房子的东方较好
    睡房的东方有窗字较顺利
    木床有利健康
    办公桌朝东有助工作效率
    吉祥颜色是绿色
    室内装璜用绿色系统
    穿衣用绿色系列
    开绿色车子较平安易发正财
    多喝点酸性饮料，忌生气，注意神精系统、肝、胆、头肩、肝胆
    多打高尔夫球、公园散步、徒步树林等户外运动
    和木有关的工作较容易。''',
                                        
    "水":'''
    身体需要注意: 胫足、膀胱肾(如结石) 多喝水
    冬天或冷天气较走运
    亥月、子月、猪年和鼠年运气较好
    晚上九点至上午一点是吉时
    北方较冷是吉方
    住朝北的房子较吉利
    睡房在房子的北方较好
    睡房的北方有窗字较顺利
    金属床或水床有利健康
    办公桌朝北有助工作效率
    吉祥颜色是黑色
    室内装璜用黑色系统
    穿衣用黑色系列，带珠宝也不错
    开黑色车子较平安易发正财
    多喝水，注意肾脏系统
    多做游泳、潜水、滑雪、钓鱼、溜冰等户外运动
    和水有关的工作较容易。''',    
                                        
    "火":'''
    夏天或热天气较走运
    午月、巳月、马年和蛇年运气较好
    上午九点至下午一点是吉时
    南方较热是吉方
    住朝南的房子较吉利
    睡房在房子的南方较好
    睡房的南方有窗字较顺利
    木床有利健康
    办公桌朝南有助工作效率
    吉祥颜色是红色
    室内装璜用红色系统
    穿衣用红色系列
    开红色车子较平安易发正财
    要常笑，注意心脏系统、血液循环、眼睛、额齿
    多做打篮球、网球、排球、骑单车等户外运动
    和火有关的工作较容易''',
    
    "土":'''
    春、夏、秋、冬四季交接之时段较走运
    丑、辰、未、戌月和牛、龙、羊、狗年运气较好
    上午二点、八点左右和下午二点、八点左右都是吉时
    起居环境和气候不要太乾或太湿
    睡房在房子的中间较好
    办公桌靠房子的中间，有助工作效率
    吉祥颜色是棕黄色
    室内装璜用棕黄色系统
    穿衣用棕黄色系列，带古玉很不错
    开棕黄色车子较平安易发正财
    勿常担心事情，太多虑 
    少吃些甜点，注意消化系统、脾、肌肉
    多做园艺、露营、走路等户外运动。下棋、宗教场所都好
    和土有关的工作较容易''',      
}


#煞神 （流年与四柱之间的煞神冲克关系）
#煞神的定义：•灾煞：表示流年中会带来灾难、意外、麻烦的煞星。•坐煞：表示个人在某个时间段中容易遇到挫折或坐守艰难的煞星。•向煞：表示某个方向或方位存在危险、障碍的煞星。•岁煞：表示流年中某个特定年份的煞星，通常与岁君（太岁）有冲克关系。•jie煞：表示容易招来破正财、盗贼之类的煞神，常与正财运、事业运等相关。
#【出处】《玉照定真经》、《三命通会》、《神峰通考》    【流派】三合派、四柱派、流年派 会喜欢用“煞神”算法。
# 岁煞为三合对冲方的三会中的库，jie煞为三合对冲方的三会中的生  
mu_years = { '灾煞': '酉', '坐煞': '庚辛','向煞': '甲乙','岁煞': '戌', 'jie煞': '申',
    
}